myDatart/myDatart-erpUpdate/src/test/resources/soaps/updateOrder-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bam="http://etnetera.com/projects/datart/bambino">
   <soapenv:Header/>
   <soapenv:Body>
      <bam:updateOrder>
         <segment>cz</segment>
         <order>
            <id>123</id>
            <orderType>ESHOP</orderType>
            <contacts>
               <email>test@test.cz</email>
               <phone>0212121212</phone>
               <cellularPhone>744010101</cellularPhone>
            </contacts>
            <totalPrice>100</totalPrice>
            <billingAddress>
               <firstName>Mira</firstName>
               <lastName>Baros</lastName>
               <street>Kozlov</street>
               <zip>14600</zip>
               <city>Praha</city>
               <country>CR</country>
            </billingAddress>
            <shippingAddress>
               <firstName>Mira</firstName>
               <lastName>Baros</lastName>
               <street>Kozlov</street>
               <zip>14600</zip>
               <city>Praha</city>
               <country>CR</country>
            </shippingAddress>
            <items>
               </items>
            <deliveries>
               </deliveries>
            <partialDelivery>false</partialDelivery>
            <state>OPEN</state>
            <dateCreated>21.02.2014T12:00:00</dateCreated>
            <dateChanged>21.02.2014T12:00:00</dateChanged>
         </order>
      </bam:updateOrder>
   </soapenv:Body>
</soapenv:Envelope>